import os
from dotenv import load_dotenv

load_dotenv()

class Config:
    # API ключи
    TELEGRAM_TOKEN = os.getenv('TELEGRAM_TOKEN')
    FOOTBALL_API_KEY = os.getenv('FOOTBALL_API_KEY')
    WEATHER_API_KEY = os.getenv('WEATHER_API_KEY')
    ADMIN_CHAT_ID = os.getenv('ADMIN_CHAT_ID')
    
    # Настройки
    INITIAL_BANK = float(os.getenv('INITIAL_BANK', 1000))
    MAX_STAKE_PERCENT = float(os.getenv('MAX_STAKE_PERCENT', 5))
    
    # Слабые лиги
    WEAK_LEAGUES = [
        "Аргентина", "Уругвай", "Чили", "Колумбия", "Парагвай",
        "Египет", "ЮАР", "Кипр", "Исландия", "Финляндия",
        "Албания", "Македония", "Грузия", "Армения", "Азербайджан",
        "Казахстан", "Узбекистан", "Беларусь"
    ]
    
    LEAGUES = [39, 140, 78, 135, 61, 40, 141, 79, 136, 62, 2, 3, 848, 
               88, 89, 94, 203, 197, 345, 106, 207, 90, 242, 272, 276,
               283, 288, 253, 289, 290, 291, 179, 218, 240, 1, 12, 45,
               46, 47, 48, 50, 71, 128, 169, 172, 176, 138, 139, 144,
               148, 149, 142, 137, 140, 250, 251, 252, 260, 261, 262,
               263, 264, 265, 266, 267]
    
    LEAGUE_NAMES = {
        39: "АПЛ", 140: "Ла Лига", 78: "Бундеслига", 135: "Серия А", 61: "Лига 1",
        40: "Чемпионшип", 141: "Ла Лига 2", 79: "2. Бундеслига", 136: "Серия В", 62: "Лига 2",
        2: "ЛЧ", 3: "ЛЕ", 848: "ЛК",
        88: "Эредивизи", 89: "Про Лига", 94: "Примейра", 203: "Греция", 197: "Турция",
        345: "Швейцария", 106: "Австрия", 207: "Шотландия",
        90: "РПЛ", 242: "Чехия", 272: "Польша", 276: "Украина", 283: "Хорватия",
        288: "Сербия", 253: "Румыния", 289: "Болгария", 290: "Словакия", 291: "Словения",
        179: "Дания", 218: "Норвегия", 240: "Швеция",
        1: "Кубок мира", 12: "Кубок Англии", 45: "Кубок Испании",
        46: "Кубок Германии", 47: "Кубок Италии", 48: "Кубок Франции", 50: "Кубок Лиги",
        71: "Бразилейрао", 128: "Аргентина", 169: "Уругвай", 172: "Чили", 176: "Колумбия",
        138: "J1 Лига", 139: "K Лига", 144: "Саудовская Аравия", 148: "ОАЭ", 149: "Катар",
        142: "Liga MX", 137: "Египет", 140: "ЮАР",
        250: "Кипр", 251: "Исландия", 252: "Финляндия",
        260: "Албания", 261: "Македония", 262: "Грузия",
        263: "Армения", 264: "Азербайджан", 265: "Казахстан",
        266: "Узбекистан", 267: "Беларусь"
    }

config = Config()
